In [1]:
import pandas as pd

In [2]:
crime = pd.read_csv( "ChicagoCrimeData.csv" )
census = pd.read_csv( "ChicagoCensusData.csv" )
school = pd.read_csv( "ChicagoPublicSchools.csv" )

In [3]:
crime.head( )

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
0,3512276,HK587712,2004-08-28,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,False,False,...,9,14.0,58.0,6,1155838.0,1873050.0,2004,41.807440,-87.703956,"(41.8074405, -87.703955849)"
1,3406613,HK456306,2004-06-26,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,False,False,...,11,27.0,23.0,6,1152206.0,1906127.0,2004,41.898280,-87.716406,"(41.898279962, -87.716405505)"
2,8002131,HT233595,2011-04-04,043XX S WABASH AVE,820,THEFT,$500 AND UNDER,NURSING HOME/RETIREMENT HOME,False,False,...,2,3.0,38.0,6,1177436.0,1876313.0,2011,41.815933,-87.624642,"(41.815933131, -87.624642127)"
3,7903289,HT133522,2010-12-30,083XX S KINGSTON AVE,840,THEFT,FINANCIAL ID THEFT: OVER $300,RESIDENCE,False,False,...,4,7.0,46.0,6,1194622.0,1850125.0,2010,41.743665,-87.562463,"(41.743665322, -87.562462756)"
4,10402076,HZ138551,2016-02-02,033XX W 66TH ST,820,THEFT,$500 AND UNDER,ALLEY,False,False,...,8,15.0,66.0,6,1155240.0,1860661.0,2016,41.773455,-87.706480,"(41.773455295, -87.706480471)"

In [6]:
crime.columns

Index(['ID', 'CASE_NUMBER', 'DATE', 'BLOCK', 'IUCR', 'PRIMARY_TYPE',
       'DESCRIPTION', 'LOCATION_DESCRIPTION', 'ARREST', 'DOMESTIC', 'BEAT',
       'DISTRICT', 'WARD', 'COMMUNITY_AREA_NUMBER', 'FBICODE', 'X_COORDINATE',
       'Y_COORDINATE', 'YEAR', 'LATITUDE', 'LONGITUDE', 'LOCATION'],
      dtype='object')

In [7]:
census.columns

Index(['COMMUNITY_AREA_NUMBER', 'COMMUNITY_AREA_NAME',
       'PERCENT_OF_HOUSING_CROWDED', 'PERCENT_HOUSEHOLDS_BELOW_POVERTY',
       'PERCENT_AGED_16__UNEMPLOYED',
       'PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA',
       'PERCENT_AGED_UNDER_18_OR_OVER_64', 'PER_CAPITA_INCOME',
       'HARDSHIP_INDEX'],
      dtype='object')

In [8]:
school.columns

Index(['School_ID', 'NAME_OF_SCHOOL', 'Elementary, Middle, or High School',
       'Street_Address', 'City', 'State', 'ZIP_Code', 'Phone_Number', 'Link',
       'Network_Manager', 'Collaborative_Name',
       'Adequate_Yearly_Progress_Made_', 'Track_Schedule',
       'CPS_Performance_Policy_Status', 'CPS_Performance_Policy_Level',
       'HEALTHY_SCHOOL_CERTIFIED', 'Safety_Icon', 'SAFETY_SCORE',
       'Family_Involvement_Icon', 'Family_Involvement_Score',
       'Environment_Icon', 'Environment_Score', 'Instruction_Icon',
       'Instruction_Score', 'Leaders_Icon', 'Leaders_Score', 'Teachers_Icon',
       'Teachers_Score', 'Parent_Engagement_Icon', 'Parent_Engagement_Score',
       'Parent_Environment_Icon', 'Parent_Environment_Score',
       'AVERAGE_STUDENT_ATTENDANCE', 'Rate_of_Misconducts__per_100_students_',
       'Average_Teacher_Attendance',
       'Individualized_Education_Program_Compliance_Rate', 'Pk_2_Literacy__',
       'Pk_2_Math__', 'Gr3_5_Grade_Level_Math__', 'Gr3_5_Grade_Level_Read__',
       'Gr3_5_Keep_Pace_Read__', 'Gr3_5_Keep_Pace_Math__',
       'Gr6_8_Grade_Level_Math__', 'Gr6_8_Grade_Level_Read__',
       'Gr6_8_Keep_Pace_Math_', 'Gr6_8_Keep_Pace_Read__',
       'Gr_8_Explore_Math__', 'Gr_8_Explore_Read__', 'ISAT_Exceeding_Math__',
       'ISAT_Exceeding_Reading__', 'ISAT_Value_Add_Math',
       'ISAT_Value_Add_Read', 'ISAT_Value_Add_Color_Math',
       'ISAT_Value_Add_Color_Read', 'Students_Taking__Algebra__',
       'Students_Passing__Algebra__', '9th Grade EXPLORE (2009)',
       '9th Grade EXPLORE (2010)', '10th Grade PLAN (2009)',
       '10th Grade PLAN (2010)', 'Net_Change_EXPLORE_and_PLAN',
       '11th Grade Average ACT (2011)', 'Net_Change_PLAN_and_ACT',
       'College_Eligibility__', 'Graduation_Rate__',
       'College_Enrollment_Rate__', 'COLLEGE_ENROLLMENT',
       'General_Services_Route', 'Freshman_on_Track_Rate__', 'X_COORDINATE',
       'Y_COORDINATE', 'Latitude', 'Longitude', 'COMMUNITY_AREA_NUMBER',
       'COMMUNITY_AREA_NAME', 'Ward', 'Police_District', 'Location'],
      dtype='object')

In [ ]:
# I could not connect neither to IBM DB2 nor to SQLite, so I write code using Pandas.

In [5]:
# I would use
# select COUNT( * ) from CRIME;

crime.shape[0]

533

In [9]:
# I would write
# select "COMMUNITY_AREA_NAME", "PER_CAPITA_INCOME" from CENSUS
# where "PER_CAPITA_INCOME" < 11000;

census[["COMMUNITY_AREA_NAME", "PER_CAPITA_INCOME"]][census["PER_CAPITA_INCOME"] < 11000]

   COMMUNITY_AREA_NAME  PER_CAPITA_INCOME
25  West Garfield Park              10934
29      South Lawndale              10402
36         Fuller Park              10432
53           Riverdale               8201

In [90]:
# my SQL command:
# select "CASE_NUMBER", "DESCRIPTION" from CRIME
# where "DESCRIPTION" LIKE '%CHILD%'
# or "DESCRIPTION" LIKE '%MINOR%';

crime[( crime["DESCRIPTION"].str.contains( "MINOR" ) ) | ( crime["DESCRIPTION"].str.contains( "CHILD" ) )][["CASE_NUMBER", "DESCRIPTION"]]

    CASE_NUMBER                     DESCRIPTION
500    HN567387  AGG SEX ASSLT OF CHILD FAM MBR
501    HR391350   SEX ASSLT OF CHILD BY FAM MBR
514    HL266884   SELL/GIVE/DEL LIQUOR TO MINOR
515    HK238408    ILLEGAL CONSUMPTION BY MINOR
520    HN144152        CHILD ABDUCTION/STRANGER

In [94]:
# my SQL command:
# select * from CRIME
# where "PRIMARY_TYPE" LIKE '%KIDNAP%';

crime[crime["PRIMARY_TYPE"].str.contains( "KIDNAP" )]

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
520,5276766,HN144152,2007-01-26,050XX W VAN BUREN ST,1792,KIDNAPPING,CHILD ABDUCTION/STRANGER,STREET,False,False,...,15,29.0,25.0,20,1143050.0,1897546.0,2007,41.874908,-87.750249,"(41.874908413, -87.750249307)"

In [97]:
# my SQL query:
# select DISTINCT( "PRIMARY_TYPE" ) from CRIME
# where "LOCATION_DESCRIPTION" LIKE '%SCHOOL%';

crime[crime["LOCATION_DESCRIPTION"].str.contains( "SCHOOL" )]["PRIMARY_TYPE"].unique( )

array(['BATTERY', 'CRIMINAL DAMAGE', 'NARCOTICS', 'ASSAULT',
       'CRIMINAL TRESPASS', 'PUBLIC PEACE VIOLATION'], dtype=object)

In [98]:
# my SQL query:
# select DISTINCT( "Elementary, Middle, or High School" ), AVG( "SAFETY_SCORE" ) from SCHOOLS
# GROUP BY "Elementary, Middle, or High School";

school.groupby( "Elementary, Middle, or High School" )["SAFETY_SCORE"].mean( )

Elementary, Middle, or High School
ES    49.520384
HS    49.623529
MS    48.000000
Name: SAFETY_SCORE, dtype: float64

In [104]:
# my SQL command:
# select "COMMUNITY_AREA_NAME", "PERCENT_HOUSEHOLDS_BELOW_POVERTY" from CENSUS
# ORDER BY "PERCENT_HOUSEHOLDS_BELOW_POVERTY" DESC
# LIMIT 5;

census[["COMMUNITY_AREA_NAME",
        "PERCENT_HOUSEHOLDS_BELOW_POVERTY"]].sort_values( by = "PERCENT_HOUSEHOLDS_BELOW_POVERTY",
                                                                                 ascending = False )[:5]

   COMMUNITY_AREA_NAME  PERCENT_HOUSEHOLDS_BELOW_POVERTY
53           Riverdale                              56.5
36         Fuller Park                              51.2
67           Englewood                              46.6
28      North Lawndale                              43.1
26  East Garfield Park                              42.4

In [130]:
# my SQL command:
# select "COMMUNITY_AREA_NUMBER" from CRIME
# GROUP BY "COMMUNITY_AREA_NUMBER"
# ORDER BY COUNT( * ) DESC LIMIT 1;

crime.groupby( "COMMUNITY_AREA_NUMBER" )[["ID"]].count( ).sort_values( by = "ID", ascending = False ).index[0]

25.0

In [127]:
# my SQL query:
# select "COMMUNITY_AREA_NAME", "HARDSHIP_INDEX" from CENSUS
# where "HARDSHIP_INDEX" = ( select MAX( "HARDSHIP_INDEX" ) from CENSUS );

census[census["HARDSHIP_INDEX"] == census["HARDSHIP_INDEX"].max( )][["COMMUNITY_AREA_NAME", "HARDSHIP_INDEX"]]

   COMMUNITY_AREA_NAME  HARDSHIP_INDEX
53           Riverdale            98.0

In [129]:
# my SQL query:
# select "COMMUNITY_AREA_NAME" from CENSUS
# where "COMMUNITY_AREA_NUMBER" IN ( select "COMMUNITY_AREA_NUMBER" from CRIME
#                                    GROUP BY "COMMUNITY_AREA_NUMBER"
#                                    ORDER BY COUNT( * ) DESC LIMIT 1 );

census[census["COMMUNITY_AREA_NUMBER"] == crime.groupby( "COMMUNITY_AREA_NUMBER" )[["ID"]].count( ).sort_values( by = "ID", ascending = False ).index[0]][["COMMUNITY_AREA_NAME"]]

24    Austin
Name: COMMUNITY_AREA_NAME, dtype: object